Week4/W4D2/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create

        cat = Cat.new(cat_params)

        if cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "birth_date" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["color", "White"], ["description", "im old ... gotcha"], ["birth_date", "1920-07-07"], ["updated_at", "2019-01-30 00:59:15.850499"], ["id", 1]]
---
    def update
      cat = Cat.find(params[:id])

      if cat.update(cat_params)